# YOLOv8m with P2 Detection Head
# Adds a 160×160 detection scale (stride 4) for small objects < 24px.
# Best modification in the ablation study: +1.54 pp mAP@50 at only +6% latency.
# Citation: Lin et al. (2017) "Feature Pyramid Networks" CVPR

nc: 4   # pothole, hump, human, vehicle
scales:
  m: [0.67, 0.75, 768]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]           # 0  P1/2
  - [-1, 1, Conv, [128, 3, 2]]          # 1  P2/4  ← tapped by P2 head
  - [-1, 3, C2f, [128, True]]           # 2
  - [-1, 1, Conv, [256, 3, 2]]          # 3  P3/8
  - [-1, 6, C2f, [256, True]]           # 4
  - [-1, 1, Conv, [512, 3, 2]]          # 5  P4/16
  - [-1, 6, C2f, [512, True]]           # 6
  - [-1, 1, Conv, [768, 3, 2]]          # 7  P5/32
  - [-1, 3, C2f, [768, True]]           # 8
  - [-1, 1, SPPF, [768, 5]]             # 9

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]           # cat backbone P4
  - [-1, 3, C2f, [512]]                 # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]           # cat backbone P3
  - [-1, 3, C2f, [256]]                 # 15  P3/8

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]]           # cat backbone P2  ← NEW
  - [-1, 3, C2f, [128]]                 # 18  P2/4  ← NEW 160×160 feature map

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 15], 1, Concat, [1]]          # cat head P3
  - [-1, 3, C2f, [256]]                 # 21  P3/8

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]          # cat head P4
  - [-1, 3, C2f, [512]]                 # 24  P4/16

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]           # cat backbone P5
  - [-1, 3, C2f, [768]]                 # 27  P5/32

  - [[18, 21, 24, 27], 1, Detect, [nc]] # Detect P2+P3+P4+P5
